---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
IFCGeometryInfo Properties
IFCGeometryInfo Class See Also Send Feedback
---

The IFCGeometryInfo type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

IFCGeometryInfo Class

Autodesk.Revit.DB.IFC Namespace